# Задача 1. Напишите программу, которая принимает на вход число N и выдает список факториалов для чисел от 1 до N.
# N = 4 -> [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

import math
def fact():
    N = int(input())
    mylist = []

    for i in range(1, N+1):
        mylist.insert(i, math.factorial(i))
    print(f"{N} -> {mylist}")

fact()

# =====================================================================================================================================================
# Задача 2. Выведите таблицу истинности для выражения ¬(X ∧ Y) ∨ Z.

def true():
    print("X | Y | Z | ¬(X ∧ Y) ∨ Z")
    for x in range(0, 2):
        for y in range(0, 2):
            for z in range(0, 2):
                print(f"{x} | {y} | {z} | {int(not(x and y) or z)}")

# true()

# =====================================================================================================================================================
# Задача 3. Даны две строки. Посчитайте сколько раз каждый символ первой строки встречается во второй
# «one» «onetwonine» - o – 2, n – 3, e – 2

def countchar():
    s1 = "one"
    s2 = "onetwonine"

    for i in range(0,len(s1)):
        count = 0
        for x in range(0,len(s2)):
            if s1[i] == s2[x:x+1]:
                count+=1
        print(f"{s1[i]} - {count}")   

# countchar()  

# =====================================================================================================================================================
# Задача 4. Задайте список из N элементов, заполненных числами из промежутка [-N, N]. Сдвиньте все элементы списка на 2 позиции вправо.
# 3 -> [2, 3, -3, -2, -1, 0, 1]

def shift():
    N = int(input())
    mylist = []
    mylist2 = []
    count = 0

    for i in range(-N, N+1):
        mylist.insert(count, i)
        count+=1

    for i in range(0, len(mylist)):
        mylist2.insert(i, mylist[i-2])
        
    print(f"{N} -> {mylist2}")

# shift()
